## Practice with Pandas Titanic Data

In [1]:
import pandas as pd
import numpy as np
from sklearn.datasets import fetch_openml

In [2]:
## Titanic data
dat = fetch_openml(data_id=40945, parser='auto')
df = dat.frame

In [3]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"


1.  How many entries are there in the dataset?

In [4]:
df.shape

(1309, 14)


2.  What variables have missing values?  How many missing values?  Are there any columns that have only missing values?

In [5]:
df.isna().sum()

pclass          0
survived        0
name            0
sex             0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64


3.  Select the rows where `embarked` equals "S".

In [6]:
df[df['embarked']=='S'] #.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

4.  How many unique values are there in `home.dest`?  What are the three most common values?

In [9]:
df['home.dest'].value_counts().sort_values(ascending=False).head(3)

home.dest
New York, NY    64
London          14
Montreal, PQ    10
Name: count, dtype: int64

5.  What is the lowest fare paid?  How many people paid that amount?

In [10]:
df['fare'].min()

0.0

In [11]:
df[df['fare'] == df['fare'].min()].shape

(17, 14)

6.  Drop the `name` column

In [12]:
df = df.drop('name', axis=1)

7.  Create a new column that adds the values of `sibsp` and `parch`.

In [13]:
df['family'] = df['sibsp'] + df['parch']

8.  Fill in the missing values of age using forward fill.  What is the mean after filling?

In [15]:
df['age_ff'] = df['age'].ffill()
df['age_ff'].mean()

30.027820320855614

9.  Fill in the missing values of age using the mean of that column?  Now what is the mean?

In [16]:
df['age_mean'] = df['age'].fillna(df['age'].mean())
df['age_mean'].mean()

29.881134512428297

10.  What is the name, sex, and age of the person that paid the highest fare?

In [18]:
df.iloc[df['fare'].idxmax(),:]

pclass                                                    1
survived                                                  1
sex                                                    male
age                                                    36.0
sibsp                                                     0
parch                                                     1
ticket                                             PC 17755
fare                                               512.3292
cabin                                           B51 B53 B55
embarked                                                  C
boat                                                      3
body                                                    NaN
home.dest    Austria-Hungary / Germantown, Philadelphia, PA
family                                                    1
age_ff                                                 36.0
age_mean                                               36.0
Name: 49, dtype: object

11.  What is the average fare paid?

In [19]:
df['fare'].mean()

33.29547928134557


12.  What is the average fare paid in each of the `pclass` categories?

In [20]:
df.groupby('pclass')['fare'].mean()

pclass
1    87.508992
2    21.179196
3    13.302889
Name: fare, dtype: float64


13.  What proportion of people in each of the `pclass` categories survived?

In [24]:
df['survived'] = df['survived'].astype('int')
df.groupby('pclass')['survived'].mean()

pclass
1    0.619195
2    0.429603
3    0.255289
Name: survived, dtype: float64


14.  Drop all the rows in which there is a missing value for both `cabin` and `home.dest`.  How many rows remain?

In [25]:
df.dropna(subset=['cabin','home.dest'], how='all').shape

(782, 16)